# vstSetDataString

## Description
```pascal
PROCEDURE vstSetDataString(
				inDataID   : LONGINT;
				inDataVal  : DYNARRAY[] of CHAR;
				VAR result : BOOLEAN);
```

```python

def vs.vstSetDataString(inDataID, inDataVal):
    return result
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inDataID|LONGINT||
|inDataVal|DYNARRAY[] of CHAR||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events